Repository: Iskandarov1/DT_HR
Catalog: DT_*.Application/Resources/SharedResource.*.resx
Languages: ru, uz

source: Welcome
ru: Добро пожаловать
uz: Xush kelibsiz

source: 🌐Select Language
ru: 🌐Выберите язык
uz: 🌐Tilni tanlang

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Back
ru: Назад
uz: Orqaga

source: Yes
ru: Да
uz: Ha

source: No
ru: Нет
uz: Yo'q

# WelcomeToDTHR
source: Welcome to DT HR Attendance System! 👋
ru: Добро пожаловать в систему учета посещаемости DT HR! 👋
uz: DT HR Davomat Tizimiga xush kelibsiz! 👋

# WelcomeBack
source: Welcome back, {0}! 👋
ru: С возвращением, {0}! 👋
uz: Qaytganingizdan xursandmiz, {0}! 👋

# PleaseSelectLanguage
source: Please select your preferred language:
ru: Пожалуйста, выберите предпочитаемый язык:
uz: Iltimos, o'zingizga qulay tilni tanlang:

# RegistrationPrompt
source: To get started, I need to register you in our system. Please share your contact information or enter your phone number manually.
ru: Для начала работы мне нужно зарегистрировать вас в системе. Пожалуйста, поделитесь контактной информацией или введите номер телефона вручную.
uz: Ishni boshlash uchun sizni tizimda ro'yxatdan o'tkazishim kerak. Iltimos, kontakt ma'lumotlaringizni ulashing yoki telefon raqamingizni qo'lda kiriting.

# ShareContactButton
source: 📱 Share Contact
ru: 📱 Поделиться контактом
uz: 📱 Kontaktni ulashish

# EnterPhoneManually
source: ✍️ Enter Phone Number
ru: ✍️ Ввести номер телефона
uz: ✍️ Telefon raqamini kiritish

# WhatWouldYouLikeToDo
source: What would you like to do next?
ru: что бы вы хотели делать дальше?
uz: keyingi ishimiz nima?

# PleaseEnterPhoneNumber
source: Please enter your phone number:
ru: Пожалуйста, введите ваш номер телефона:
uz: Iltimos, telefon raqamingizni kiriting:

# PhoneNumberExample
source: Example: +998901234567 or 901234567
ru: Пример: +998901234567 или 901234567
uz: Misol: +998901234567 yoki 901234567

# InvalidPhoneFormat
source: ❌ Invalid phone number format. Please enter a valid Uzbek phone number.
ru: ❌ Неверный формат номера телефона. Пожалуйста, введите корректный узбекский номер телефона.
uz: ❌ Noto'g'ri telefon raqami formati. Iltimos, to'g'ri O'zbekiston telefon raqamini kiriting.

# ChooseHowToShare
source: How would you like to share your phone number?
ru: Как вы хотите поделиться номером телефона?
uz: Telefon raqamingizni qanday ulashmoqchisiz?

# RegistrationSuccessful
source: ✅ Registration successful! Welcome to DT HR System.
ru: ✅ Регистрация прошла успешно! Добро пожаловать в систему DT HR.
uz: ✅ Ro'yxatdan o'tish muvaffaqiyatli amalga oshirildi! DT HR tizimiga xush kelibsiz.

# RegistrationFailed
source: ❌ Registration failed: {0}
ru: ❌ Регистрация не удалась: {0}
uz: ❌ Ro'yxatdan o'tish amalga oshmadi: {0}

# ContactReceived
source: 📱 Contact received but no action was pending.
ru: 📱 Контакт получен, но никаких действий не ожидалось.
uz: 📱 Kontakt qabul qilindi, lekin hech qanday amal kutilmagan.

source: ✅ Check In
ru: ✅ Отметиться на работе
uz: ✅ Ishga keldim

source: ⏰ Check Out
ru: ⏰ Завершить работу
uz: ⏰ Ishdan ketish

source: 🏠 Report Absence
ru: 🏠 Сообщить об отсутствии
uz: 🏠 Ishga Kelmadim

source: 📍 **Check-In Process**
ru: 📍 **Процесс отметки прихода**
uz: 📍 **Ishga kelishni belgilash jarayoni**

# ShareLocationPrompt
source: Please share your current location to check in. Make sure you're within the office radius for successful check-in.
ru: Пожалуйста, поделитесь своим текущим местоположением для отметки. Убедитесь, что вы находитесь в радиусе офиса для успешной отметки.
uz: Ishga kelishingizni belgilash uchun joriy joylashuvingizni ulashing. Muvaffaqiyatli belgilash uchun ofis radiusida ekanligingizga ishonch hosil qiling.

source: 📍 Share Location
ru: 📍 Поделиться местоположением
uz: 📍 Joylashuvni ulashish

# CheckInCompleted
source: Check-in completed! What would you like to do next?
ru: Отметка прихода выполнена! Что бы вы хотели сделать дальше?
uz: Ishga kelish belgilandi! Keyin nima qilmoqchisiz?

source: Check-in failed:
ru: Отметка прихода не удалась:
uz: Ishga kelishni belgilash amalga oshmadi:

# LocationReceived
source: 📍 Location received but no action was pending. Use /checkin to check in.
ru: 📍 Местоположение получено, но никаких действий не ожидалось. Используйте /checkin для отметки прихода.
uz: 📍 Joylashuv qabul qilindi, lekin hech qanday amal kutilmagan. Ishga kelishni belgilash uchun /checkin buyrug'idan foydalaning.

source: Check-out completed!
ru: Отметка ухода выполнена! Хорошего дня!
uz: Ishdan ketish belgilandi! Yaxshi kun tilaymiz!

source: Check-out failed:
ru: Отметка ухода не удалась:
uz: Ishdan ketishni belgilash amalga oshmadi:

# ReportAbsenceTitle
source: 📋 **Report Absence**
ru: 📋 **Сообщить об отсутствии**
uz: 📋 **Kelmaslik haqida xabar berish**

# SelectAbsenceReason
source: Please select the reason for your absence:
ru: Пожалуйста, выберите причину вашего отсутствия:
uz: Iltimos, kelmaslik sababini tanlang:

# Sick
source: 🤒 Sick/Absent
ru: 🤒 Болен/Отсутствую
uz: 🤒 Kasal/Kelmayman

source: 🚗 On the way
ru: 🚗 В пути
uz: 🚗Yo'lda

source: 😴 Overslept
ru: 😴 Проспал
uz: 😴 Uxlab qoldim

source: 📝 Other reason
ru: 📝 Другая причина
uz: 📝 Boshqa sabab

# AbsenceRecorded
source: Your absence has been recorded.
ru: Ваше отсутствие зарегистрировано.
uz: Kelmasligingiz qayd etildi.

# AbsenceReasonPrompt
source: Please describe your condition or reason for absence:
ru: Пожалуйста, опишите ваше состояние или причину отсутствия:
uz: Iltimos, ahvolingiz yoki kelmaslik sababini tavsiflang:

# OnTheWayPrompt
source: 🚗 You're on the way! Please provide: Reason for being late. Expected arrival time (format: HH:MM) Example: "Traffic jam, 10:30"
ru: 🚗 Вы в пути! Пожалуйста, укажите: Причину опоздания. Ожидаемое время прибытия (формат: ЧЧ:ММ) Пример: "Пробка, 10:30"
uz: 🚗 Raxmat, Iltimos quyidagilarni ko'rsating: Kechikish sababi. Kutilayotgan kelish vaqti (format: Soat:Daqiqa) Misol: "Tirbandlik, 10:30"

# OversleptPrompt
source: 😴 **Overslept** When do you expect to arrive?
ru: 😴 **Проспал** Когда вы планируете прибыть?
uz: 😴 Qachon kelishni rejalashtiryapsiz?

# OtherReasonPrompt
source: Please provide: Your reason for absence. Expected arrival time if you're coming (format: HH:MM) or type "absent" if not coming Example: "Doctor appointment, 14:00" or "Family emergency, absent"
ru: Пожалуйста, укажите Причину отсутствия.
uz: Iltimos, quyidagilarni ko'rsating: 1.Kelmaslik sababi. 2.Agar kelsangiz, kutilayotgan kelish vaqti (format: Daqiqa yoki kelmasangiz "kelmayman" deb yozing Misol: "Shifokorga tashrif, 14:00" yoki "Oilaviy holat, kelmayman"

# InvalidTimeFormat
source: ❌ Please provide a valid time format (HH:MM).
ru: ❌ Пожалуйста, укажите время в правильном формате (ЧЧ:ММ).
uz: ❌ Iltimos, vaqtni to'g'ri formatda ko'rsating (SS:DD).

# TimeFormatExample
source: ❌ Please provide a valid time format (HH:MM). Example: 'Traffic, 10:30'
ru: ❌ Пожалуйста, укажите время в правильном формате (ЧЧ:ММ). Пример: 'Пробка, 10:30'
uz: ❌ Iltimos, vaqtni to'g'ri formatda ko'rsating (SS:DD). Misol: 'Tirbandlik, 10:30'

# ErrorOccurred
source: ❌ An error occurred. Please try again.
ru: ❌ Произошла ошибка. Пожалуйста, попробуйте снова.
uz: ❌ Xatolik yuz berdi. Iltimos, qaytadan urinib ko'ring.

# UnsupportedMessageType
source: ❌ Unsupported message type. Please use the menu options.
ru: ❌ Неподдерживаемый тип сообщения. Пожалуйста, используйте опции меню.
uz: ❌ Qo'llab-quvvatlanmaydigan xabar turi. Iltimos, menyu variantlaridan foydalaning.

# OptionNotAvailable
source: Sorry, this option is not available
ru: Извините, эта опция недоступна
uz: Kechirasiz, bu variant mavjud emas

# PleaseSelectFromMenu
source: Please select an option from the menu:
ru: Пожалуйста, выберите опцию из меню:
uz: Iltimos, menyudan variantni tanlang:

source: ✅ **Check-in Successful!**
ru: ✅ **Отметка прихода выполнена успешно!**
uz: ✅ **Ishga kelish muvaffaqiyatli belgilandi!**

source: Office location verified
ru: Местоположение офиса подтверждено
uz: Ofis joylashuvi tasdiqlandi

source: Outside office radius
ru: Вне радиуса офиса
uz: Ofis radiusidan tashqarida

source: On time
ru: Вовремя
uz: O'z vaqtida

source: Late Arrival
ru: Позднее прибытие
uz: Kech kelish

source: late
ru: опоздание
uz: kechikish

source: Have a Productive Day! 🚀
ru: Продуктивного дня! 🚀
uz: Samarali kun tilaymiz! 🚀

source: ✅ **Check-out Successful!**
ru: ✅ **Отметка ухода выполнена успешно!**
uz: ✅ **Ishdan ketish muvaffaqiyatli belgilandi!**

source: Goodbye
ru: До свидания
uz: Xayr

source: Status
ru: Статус
uz: Holat

source: Regular departure
ru: Обычный уход
uz: ketish

source: Early Departure
ru: Ранний уход
uz: Erta ketish

source: early
ru: рано
uz: erta

source: Work duration
ru: Продолжительность работы
uz: Ish davomiyligi

source: Work duration: not available
ru: Продолжительность работы: недоступно
uz: Ish davomiyligi: mavjud emas

source: Have a great day! 🌟
ru: Хорошего дня! 🌟
uz: Yaxshi kun tilaymiz! 🌟

# checkInFailedCall
source: Check-in failed
ru: Отметка прихода не удалась
uz: Ishga kelishni belgilash amalga oshmadi

# tryAgainCall
source: Try again
ru: Пожалуйста, попробуйте снова или обратитесь в поддержку
uz: Iltimos, qaytadan urinib ko'ring yoki yordam xizmatiga murojaat qiling

source: Reason
ru: Причина
uz: Sabab

source: Date
ru: Дата
uz: Sana

source: Marked at
ru: Отмечено на
uz: Belgilangan

source: Expected
ru: ожидаемое время
uz: Kelish vaqt

source: Absence recorded
ru: Отсутствие зафиксировано
uz: Malumot Saqlandi

# Thanks
source: Thanks for letting us know
ru: Спасибо, что сообщили нам.
uz: Bizga xabar berganingiz uchun tashakkur

source: 📊 Attendance Stats
ru: 📊 Статистика
uz: 📊 Statistika

# AttendanceDetails
source: 📋 Detailed Attendance
ru: 📊 информация по дате
uz: 📋 Batafsil

source: ⚙️Settings
ru: ⚙️Настройки
uz: ⚙️Sozlamalar

# LanguageChanged
source: ✅ Language changed successfully!
ru: ✅ Язык успешно изменен!
uz: ✅ Til muvaffaqiyatli o'zgartirildi!

source: 📅 Create Event
ru: 📅 Создать событие
uz: 📅 Tadbir yaratish

# EnterEventDescription
source: Please enter the event description
ru: Описание события
uz: Tadbiringiz haqida ma'lumot kiriting

# EnterEventTime
source: Please enter the event time (HH:mm)
ru: Введите время события ( HH:mm)
uz: Tadbir vaqtini kiriting (dd-MM-yyyy HH:mm)

# EventCreated
source: Event scheduled
ru: Событие создано
uz: Tadbir saqlandi

source: Event reminder
ru: Напоминание о событии
uz: Tadbir eslatmasi

# events
source: 📅 My Events
ru: 📅 Мои события
uz: 📅 Tadbirlarim

# NoEvents
source: No upcoming events
ru: Предстоящих событий нет
uz: Yaqin tadbirlar yo'q

source: Only managers can create events
ru: Создавать события могут только менеджеры
uz: Tadbirlarni faqat menejerlar yaratishi mumkin

# ThankYouCheckIn
source: ✅ Thank you for checking in on time! Have a great day at work.
ru: ✅ Спасибо, что зашли вовремя! Хорошего вам дня на работе.
uz: ✅ O'z vaqtida ro'yxatdan o'tganingiz uchun tashakkur! Ishda kuningiz yaxshi o'tsin.

# CheckInCheck
source: 📋Good morning, are you at work?
ru: 📋Доброе утро, ты на работе?
uz: 📋xayrli tong, siz ish joyingizdamisiz

# TimePassed
source: ⏰ Your estimated arrival time has passed. Please check in if you have arrived.
ru: ⏰ Расчетное время вашего прибытия уже прошло. Пожалуйста, зарегистрируйтесь, если вы прибыли.
uz: ⏰ Taxminiy kelish vaqtingiz oʻtdi. Iltimos, kelganingizni tekshiring.

# EnterBirthDate
source: Please enter your birth date (dd-MM-yyyy)
ru: Введите дату рождения (dd-MM-yyyy)
uz: Tug'ilgan kuningizni kiriting (dd-MM-yyyy)

# InvalidDateFormat
source: ❌ Invalid date format. Please use dd-MM-yyyy.
ru: ❌ Неверный формат даты. Используйте dd-MM-yyyy.
uz: ❌ Sana formati noto'g'ri. dd-MM-yyyy shaklida kiriting.

source: 🎉 Happy Birthday!
ru: 🎉 С Днём Рождения!
uz: 🎉 Tug'ilgan kuningiz muborak!

# HolidayGreeting
source: 🎉 Happy {0}!
ru: 🎉 С праздником {0}!
uz: 🎉 {0} bayramingiz muborak!

source: Present
ru: Отсутствует
uz: Tasdiqlandi

source: Absent
ru: Tasdiqlandi
uz: Yo'q

source: Total Employees
ru: Всего сотрудников
uz: Jami Hodimlar

source: Attendance Rate
ru: Уровень посещаемости
uz: Davomat darajasi

# OnTheWayAcknowledgement
source: 🚗 Got it! You're on your way. 📅 Expected arrival: {0} 💬 Reason: {1} We'll check with you around {0} to confirm your arrival. Safe travels! 🚗💨
ru: 🚗 Понял! Вы в пути. 📅 Ожидаемое прибытие: {0} 💬 Причина: {1} Мы свяжемся с вами около {0}, чтобы подтвердить ваше прибытие. Счастливого пути! 🚗💨
uz: 🚗 Qabul qilindi! 📅 Taxminiy kelish vaqti: {0} 💬 Sabab: {1} {0} atrofida yetib kelganingizni tasdiqlash uchun siz bilan bog'lanamiz. Xavfsiz sayohat! 🚗💨

# AlreadyCheckedIn
source: You have already checked in today.
ru: Вы уже отметились сегодня.
uz: Siz bugun allaqachon kelganingizni belgilagansiz.

# AlreadyReportedAbsence
source: You have already reported your absence today.
ru: Вы уже сообщили об отсутствии сегодня.
uz: Siz bugun allaqachon yo‘qligingizni xabar qilgansiz.

# AlreadyCheckedOut
source: You have already checked out today.
ru: Вы уже отметились об уходе сегодня.
uz: Siz bugun allaqachon ketganingizni belgilagansiz.

# CheckInFirstBeforeCheckOut
source: You must check in first before checking out.
ru: Сначала отметьтесь о приходе, затем об уходе.
uz: Avval kelganingizni belgilab, keyin ketganingizni belgilang.

source: Please check in first.
ru: Сначала отметьтесь о приходе.
uz: Iltimos, avval kelganingizni belgilang.

# TimeSet
source: ✅ETA set
ru: ✅время установлено
uz: ✅Kelish vaqti belgilandi

# AbsenceOptionsSelected
source: Absence options selected successfully
ru: ✅Параметры отсутствия выбраны успешно
uz: ✅Yo'qlik opsiyalari muvaffaqiyatli tanlandi

source: Event
ru: Событие
uz: Tadbir

# UpcomingEvents
source: Events
ru: События
uz: Tadbirlar

# ETA
source: Please provide your ETA - HH:MM
ru: Пожалуйста, укажите ваше расчетное время прибытия - ЧЧ:ММ
uz: Iltimos kelish vaqtingizni belgilang - HH:ММ

source: 📊 Export Attendance
ru: 📊 Экспорт посещаемости
uz: 📊 Davomat hisobotini eksport qilish

# SelectDateRange
source: 📅 Select date range for export:
ru: 📅 Выберите диапазон дат для экспорта:
uz: 📅 Eksport uchun sana oralig'ini tanlang:

source: 📅 Today
ru: 📅 Сегодня
uz: 📅 Bugun

source: 📅 This Week
ru: 📅 Эта неделя
uz: 📅 Shu hafta

source: 📅 This Month
ru: 📅 Этот месяц
uz: 📅 Shu oy

source: 📅 Custom Range
ru: 📅 Выборочный период
uz: 📅 Maxsus oraliq

# EnterStartDate
source: 📅 Enter start date (dd-MM-yyyy):
ru: 📅 Введите дату начала (ДД-ММ-ГГГГ):
uz: 📅 Boshlash sanasini kiriting (dd-MM-yyyy):

# EnterEndDate
source: 📅 Enter end date (dd-MM-yyyy):
ru: 📅 Введите дату окончания (ДД-ММ-ГГГГ):
uz: 📅 Tugash sanasini kiriting (dd-MM-yyyy):

source: ❌ Start date must be before end date
ru: ❌ Дата начала должна быть раньше даты окончания
uz: ❌ Boshlash sanasi tugash sanasidan oldin bo'lishi kerak

source: 📅 Select start date
ru: 📅 Выберите дату начала

source: 📅 Select end date
ru: 📅 Выберите дату окончания

source: ✅ Start date selected
ru: ✅ Дата начала выбрана

source: ✅ End date selected
ru: ✅ Дата окончания выбрана

# GeneratingReport
source: ⏳ Generating attendance report...
ru: ⏳ Генерируется отчет посещаемости...
uz: ⏳ Davomat hisoboti tayyorlanmoqda...

# ExportFailed
source: ❌ Failed to export attendance data
ru: ❌ Не удалось экспортировать данные посещаемости
uz: ❌ Davomat ma'lumotlarini eksport qilib bo'lmadi

# AttendanceReportGenerated
source: ✅ Attendance report generated successfully
ru: ✅ Отчет посещаемости успешно сгенерирован
uz: ✅ Davomat hisoboti muvaffaqiyatli yaratildi

source: Attendance Report
ru: Отчет посещаемости
uz: Davomat hisoboti

source: Employee Name
ru: Имя сотрудника
uz: Xodim ismi

source: Phone Number
ru: Номер телефона
uz: Telefon raqami

source: Check In Time
ru: Время прихода
uz: Kelish vaqti

source: Check Out Time
ru: Время ухода
uz: Ketish vaqti

source: Is Late
ru: Опоздание
uz: Kechikish

source: Late By
ru: Опоздал на
uz: Kechikish miqdori

source: Absence Reason
ru: Причина отсутствия
uz: Yo'qliq sababi

source: Within Office Radius
ru: В радиусе офиса
uz: Ofis radiusida

source: No Record
ru: Нет записи
uz: Ma'lumot yo'q

# DateSelected
source: ✅Date selected successfully
ru: ✅ Дата выбрана успешно
uz: ✅ Sana muvaffaqiyatli tanlandi

source: Birthdays
ru: дни рождения
uz: Tugilgan Kunlar

source: ⏰ Work Time Settings
ru: ⏰ Настройки рабочего времени
uz: ⏰ Ish vaqti sozlamalari

# SetWorkStartTime
source: 🕘 Set Start Time
ru: 🕘 Установить время начала
uz: 🕘 Boshlanish vaqtini belgilash

# SetWorkEndTime
source: 🕐 Set End Time
ru: 🕐 Установить время окончания
uz: 🕐 Tugash vaqtini belgilash

# WorkStartTime
source: Start Time
ru: Время начала
uz: Boshlanish vaqti

# WorkEndTime
source: End Time
ru: Время окончания
uz: Tugash vaqti

# CurrentWorkHours
source: 📅 Current Work Hours: Start: {0} End: {1}
ru: 📅 Текущее рабочее время: Начало: {0} Окончание: {1}
uz: 📅 Hozirgi ish vaqti: Boshlash: {0} Tugash: {1}

# WorkHoursUpdated
source: ✅ Work hours updated successfully!
ru: ✅ Рабочее время успешно обновлено!
uz: ✅ Ish vaqti muvaffaqiyatli yangilandi!

# EnterWorkStartTime
source: 🕘 Please enter your new work start time (HH:MM format): Example: 09:00
ru: 🕘 Пожалуйста, введите новое время начала работы (формат ЧЧ:ММ): Пример: 09:00
uz: 🕘 Yangi ish boshlanish vaqtini kiriting (SS:DD format): Masalan: 09:00

# EnterWorkEndTime
source: 🕐 Please enter your new work end time (HH:MM format): Example: 18:00
ru: 🕐 Пожалуйста, введите новое время окончания работы (формат ЧЧ:ММ): Пример: 18:00
uz: 🕐 Yangi ish tugash vaqtini kiriting (SS:DD format): Masalan: 18:00

# WorkStartTimeSet
source: ✅ Work start time set to {0}
ru: ✅ Время начала работы установлено на {0}
uz: ✅ Ish boshlanish vaqti {0} ga o'rnatildi

# WorkEndTimeSet
source: ✅ Work end time set to {0}
ru: ✅ Время окончания работы установлено на {0}
uz: ✅ Ish tugash vaqti {0} ga o'rnatildi

# InvalidWorkTimeRange
source: ❌ Invalid time range! Start time must be earlier than end time.
ru: ❌ Неверный диапазон времени! Время начала должно быть раньше времени окончания.
uz: ❌ Noto'g'ri vaqt oralig'i! Boshlanish vaqti tugash vaqtidan oldin bo'lishi kerak.
